##### 7. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import getpass

password = "mDd3oNM.RDj2kV_ZkV3z-khcHCeJ"

connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

rentals_may = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
rentals_june = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)

##### 8. Check the number of rentals for each customer for May

In [3]:
may = pd.read_sql_query('SELECT customer_id, COUNT(rental_id) AS rental_count FROM sakila.rentals_may GROUP BY customer_id'
, engine)
may.head()

   customer_id  rental_count
0          130             2
1          459             1
2          408             3
3          333             1
4          222             4

##### 9. Check the number of rentals for each customer for June

In [4]:
june = pd.read_sql_query('SELECT customer_id, COUNT(rental_id) AS rental_count FROM sakila.rentals_june GROUP BY customer_id'
, engine)
june.head()

   customer_id  rental_count
0          416             5
1          516             6
2          239             5
3          285             3
4          310             6

##### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes.

In [30]:
merged = pd.merge(may, june, how='outer', on='customer_id')
merged.fillna(0, axis=1, inplace=True)

merged['check'] = merged['rental_count_x'] < merged['rental_count_y']
merged.head()

   customer_id  rental_count_x  rental_count_y  check
0          130             2.0             6.0   True
1          459             1.0             7.0   True
2          408             3.0             3.0  False
3          333             1.0             4.0   True
4          222             4.0             2.0  False

In [32]:
merged = merged.rename(columns={"rental_count_x": "rental_count_may", 
"rental_count_y": "rental_count_june"})
merged.tail()

     customer_id  rental_count_may  rental_count_june  check
577          487               0.0                1.0   True
578          555               0.0                1.0   True
579          425               0.0                1.0   True
580          335               0.0                1.0   True
581          226               0.0                2.0   True